Revit 2027 API
ParameterTypeId.FabricationPartItemNumber Property
 "Item Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartItemNumber { get; }
Public Shared ReadOnly Property FabricationPartItemNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartItemNumber {
	ForgeTypeId^ get ();
}
static member FabricationPartItemNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace